multiRegion/CHT/VoFcoolingCylinder2D/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc patchAverage
(
    name=cylinderT,
    region=fluid,
    patch=fluid_to_solid,
    field=T
)
#includeFunc patchAverage
(
    name=inletU,
    region=fluid,
    patch=inlet,
    field=U
)

// ************************************************************************* //
